/* "Alert body when trying to download a file and it is not in the right format" */
"alert.message.notValidData" = "Не удалось разобрать ответ JSON";

/* If something went wrong, but the writing was generally successful */
" However, there was an error writing one or more of the files" = " Произошла ошибка при записи одного или нескольких файлов.";

/* Actionsheet message for stating that nothing was generated  */
"An error has occurred and no files have been generated." = "В результате ошибки файлы не были созданы.";

/* Title of an alert if there is an error getting content of a url */
"An Error Occurred" = "Произошла ошибка";

/* The title for the action sheet saying something went wrong */
"An error occurred while verifying the JSON" = "Произошла ошибка при проверке JSON";

/* Label to have the user select which folder to choose */
"Choose" = "Выбрать";

/* Button to dismiss an action sheet */
"OK" = "OK";

/* Prompt user gets to enter a URL */
"Enter URL..." = "Введите URL...";

/* No comment provided by engineer. */
"Expected content type %@, got %@" = "Ожидаемый тип данных %1$@, получен %2$@";

/* No comment provided by engineer. */
"Expected status code %@, got %d" = "Ожидаемый код %1$@, получен %2$d";

/* Toolbar item name for General Preferences */
"General" = "Общие";

/* This is the current title of http options window that gets written */
"Options" = "Опции";

/* In the save portion, the label to choose what language */
"Output Language" = "Язык вывода";

/* In the save portion, the label to choose what the package is */
"Package Name" = "Название пакета";

/* In the save portion, the prompt to specify what the base class is */
"Base Class" = "Исходные данные";

/* In the main screen, this is the verify button that formats the JSON */
"Verify" = "Проверить";

/* In the main screen, this is the button that fetches data from a URL */
"Get Data" = "Получить данные";

/* In the main screen, this is the button that writes out files */
"Generate Files" = "Сгенерировать файлы";

/* Error message to state the JSON didn't start with a {} or [] */
"JSON text did not start with array or object." = "JSON текст не начинается с массива или объекта.";

/* Message in an actionsheet stating that the write is successful */
"Success!" = "Запись прошла успешно!";

/* Message when writing the files, nothing was written */
"No file were written to the disk" = "Не удалось записать файлы на диск.";

/* If there is nothing in the JSON field, state that there is nothing there */
"There is no content to parse." = "Отсутствуют данные для обработки.";

/* Success message in an action sheet */
"Your files have successfully been generated." = "Ваши файлы успешно сгенерированы.";

/* The prompt to tell the user they are about to overwrite the files in the existing application */
"This operation will overwrite files in this directory. Are you sure you want to continue?" = "С помощью данной операции вы перезапишете файлы в данной папке. Вы уверены, что хотите продолжить?";

/* Cancel button in the overwrite files prompt */
"Cancel" = "Выйти";

/* Button text to overwrite files */
"Overwrite Files" = "Перезаписать файлы";

/* The title of the prompt to tell the user they are about to overwrite the files in the existing application */
"Overwrite files?" = "Перезаписать файлы?";

/* In the save portion, for objective C, determine whether or not to use ARC */
"Use Automatic Reference Counting" = "Использовать автоматический подсчет ссылок";

/* "The letters to prepend to the file */
"Class Prefix" = "Префикс файла";

/*************** HTTP OPTIONS WINDOW STRINGS *************/

/* Title for the Method box in the HTTP Options window */
"Method" = "метод";

/* Title for the Headers box in the HTTP Options window */
"Headers" = "Заголовки";

/* Title for the field to enter a HTTP header key */
/* Title for the column of HTTP header keys */
"Key" = "ключ";

/* Title for the field to enter a HTTP header value */
/* Title for the column of HTTP header values */
"Value" = "значение";

/* Title for the Add header button in the HTTP Options window */
"Add" = "добавлять";

